export const regex = {
    password: {
        value: /^(?=.*[a-zа-щьюяґєії])(?=.*[A-ZА-ЩЬЮЯҐЄІЇ])(?=.*\d)[a-zа-щьюяґєіїA-ZА-ЩЬЮЯҐЄІЇ\d\w\W]{8,}$/,
        message: "Ваш пароль повинен містити щонайменше 8 символів, одну літеру верхнього регістру, одну літеру нижнього регістру та щонайменше одну цифру"
    },
    oneToSixDigits: {
        value: /^[1-6]$/,
        message: "Число повинно бути з проміжку 1-6"
    },
    text: {
        value: /^[a-zа-щьюяґєіїA-ZА-ЩЬЮЯҐЄІЇ]{2,}$/,
        message: "Поле повинно містити щонайменше 2 символи та складатись з латиниці/кирилиці"
    },
    textWithSpaces: length => ({
        value: new RegExp("^[a-zа-щьюяґєіїA-ZА-ЩЬЮЯҐЄІЇ ]{" + length + ",}$"),
        message: "Поле повинно містити щонайменше " + length + " символів та складатись з латиниці/кирилиці"
    })
};
